cfg/DataProcessors/АнализНеявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>АнализНеявок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КадровыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КомандировкиОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтсутствиеНаРаботеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтбиратьСобытияПоДокументу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчетногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Неявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неявка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КадровыйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КомандировкиОрганизаций</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтсутствиеНаРаботеОрганизаций</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтпускаОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
								<v8:Type>cfg:DocumentRef.НевыходыВОрганизациях</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
								<v8:Type>cfg:DocumentRef.РегистрацияПростоевВОрганизациях</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтпускПоУходуЗаРебенком</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаНетрудоспособности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныНетрудоспособности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОплаты</Name>
							<Comment>Процент оплаты</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервичныйБольничныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПростоя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПростояРаботника</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДублирующаясяСтрока</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийГодС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийГодПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокРасчетаОтпуска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтпуска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйДокумент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплачиваемыйОтпуск</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfg/DataProcessors/АнализНеявок/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мОрганизация;
Перем мСоответствиеТиповДокументов;

// Диалог настройки периода
Перем мНастройкаПериода;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(НСтр("ru='Отпуска организации';uk='Відпустки організації'"));
	СписокТипов.Добавить(НСтр("ru='Командировки организации';uk='Відрядження організації'"));
	СписокТипов.Добавить(НСтр("ru='Отсутствие на работе организации';uk='Відсутність на роботі організації'"));
	мСоответствиеТиповДокументов.Вставить(НСтр("ru='Отпуска организации';uk='Відпустки організації'"),Новый ОписаниеТипов("ДокументСсылка.ОтпускаОрганизаций"));
	мСоответствиеТиповДокументов.Вставить(НСтр("ru='Командировки организации';uk='Відрядження організації'"),Новый ОписаниеТипов("ДокументСсылка.КомандировкиОрганизаций"));
	мСоответствиеТиповДокументов.Вставить(НСтр("ru='Отсутствие на работе организации';uk='Відсутність на роботі організації'"),Новый ОписаниеТипов("ДокументСсылка.ОтсутствиеНаРаботеОрганизаций"));
	
	ЭлементыФормы.ТипДокумента.СписокВыбора = СписокТипов;
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии()
	
	Если Не ОтбиратьСобытияПоДокументу Тогда
		
		Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
			ДатаНачала		= НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
			ДатаОкончания	= КонецМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
		КонецЕсли;	
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КадровыйДокумент) Тогда
		КадровыйДокумент = Документы.ОтпускаОрганизаций.ПустаяСсылка()
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипДокумента) Тогда
		ТипДокумента = НСтр("ru='Отпуска организации';uk='Відпустки організації'")
	КонецЕсли;
	
	Если Организация.Пустая() Тогда
		Организация   = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	
	Если Не (Организация.Пустая() Или ОтбиратьСобытияПоДокументу И КадровыйДокумент.Пустая()) Тогда
		Автозаполнение();
	КонецЕсли;
	
	Если Неявки.Количество() > 0 Тогда
		ЭлементыФормы.Неявки.ТекущаяСтрока = Неявки[0];
	КонецЕсли;
	
	// определяем значения для дальнейшего использования
	
	мОрганизация	= Организация;
	// Установить настройку периода по умолчанию 
	мНастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период; 
	
КонецПроцедуры

Процедура ПриПовторномОткрытии(СтандартнаяОбработка)
	Если Не (Организация.Пустая() Или ОтбиратьСобытияПоДокументу И КадровыйДокумент.Пустая()) Тогда
		Автозаполнение();
	КонецЕсли;
	Если Неявки.Количество() > 0 Тогда
		ЭлементыФормы.Неявки.ТекущаяСтрока = Неявки[0];
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

Процедура КоманднаяПанельНеявкиОбновить(Кнопка)
	
	Автозаполнение();
	
КонецПроцедуры

// Процедура устанавливает пометку у всех строк таблицы.
//
Процедура КоманднаяПанельНеявкиУстановитьФлаги(Кнопка)
	
	Для Каждого СтрокаТЧ Из Неявки Цикл
    	СтрокаТЧ.Отметка = Истина
	КонецЦикла;	
	
КонецПроцедуры

// Процедура снимает пометку у всех строк таблицы.
//
Процедура КоманднаяПанельНеявкиСнятьфлаги(Кнопка)
	
	Для Каждого СтрокаТЧ Из Неявки Цикл
    	СтрокаТЧ.Отметка = Ложь
	КонецЦикла;	
	
КонецПроцедуры

// Инвертирует флаги в табличной части 
//
Процедура КоманднаяПанельНеявкиИнвертировать(Кнопка)
	
	Для Каждого СтрокаТаблицы Из Неявки Цикл		
		СтрокаТаблицы.Отметка = Не СтрокаТаблицы.Отметка;
	КонецЦикла;
	
КонецПроцедуры

Процедура КоманднаяПанельНеявкиКадровыйДокумент(Кнопка)
	ТекущаяСтрока = ЭлементыФормы.Неявки.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено И ЗначениеЗаполнено(ТекущаяСтрока.КадровыйДокумент) Тогда
		ТекущаяСтрока.КадровыйДокумент.ПолучитьФорму().Открыть()
	КонецЕсли;
КонецПроцедуры

Процедура КоманднаяПанельНеявкиРасчетныйДокумент(Кнопка)
	ТекущаяСтрока = ЭлементыФормы.Неявки.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено И ЗначениеЗаполнено(ТекущаяСтрока.РасчетныйДокумент)  Тогда
		ТекущаяСтрока.РасчетныйДокумент.ПолучитьФорму().Открыть()
	КонецЕсли;
КонецПроцедуры

// Процедура создает документы по пустым строкам табличной части
//
Процедура ДействияФормыСоздать(Кнопка)
	
	СоздатьДокументы();	
	
КонецПроцедуры

// Процедура рассчитывает отмеченные документы
//
Процедура ДействияФормыРассчитать(Кнопка)
	
	РассчитатьДокументы();

КонецПроцедуры

// Процедура проводит отмеченные документы
//
Процедура ДействияФормыПровести(Кнопка)

	ПровестиДокументы();	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Процедура - обработчик события "ПриИзменении" поля ввода "Организация".
//
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если мОрганизация <> Организация Тогда
		Неявки.Очистить();
	КонецЕсли;
	мОрганизация = Организация;
	
	ЗаполнениеДокументов.ПриИзмененииЗначенияОрганизации(ЭтотОбъект);

	Если Не (Организация.Пустая() Или ОтбиратьСобытияПоДокументу И КадровыйДокумент.Пустая()) Тогда
		Автозаполнение();
		Если Неявки.Количество() > 0 Тогда
			ЭлементыФормы.Неявки.ТекущаяСтрока = Неявки[0]
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки настройки периода.
//
Процедура ВыбПериодНажатие(Элемент)
	
	мНастройкаПериода.УстановитьПериод(ДатаНачала, КонецДня(ДатаОкончания));
	
	Если мНастройкаПериода.Редактировать() Тогда
		ДатаНачала		= мНастройкаПериода.ПолучитьДатуНачала();
		ДатаОкончания	= мНастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	
КонецПроцедуры // ВыбПериодНажатие()

Процедура ТипДокументаПриИзменении(Элемент)
	ЗначениеВыбрано = мСоответствиеТиповДокументов[Элемент.Значение] <> Неопределено;
	ЭлементыФормы.КадровыйДокумент.ТолькоПросмотр = Не ЗначениеВыбрано;
	Если ЗначениеВыбрано Тогда
		КадровыйДокумент = мСоответствиеТиповДокументов[Элемент.Значение].ПривестиЗначение(КадровыйДокумент);
	Иначе 
		КадровыйДокумент = ""
	КонецЕсли;
КонецПроцедуры

Процедура КадровыйДокументПриИзменении(Элемент)
	Если ОтбиратьСобытияПоДокументу И Не (Организация.Пустая() Или КадровыйДокумент.Пустая()) Тогда
		Автозаполнение();
		Если Неявки.Количество() > 0 Тогда
			ЭлементыФормы.Неявки.ТекущаяСтрока = Неявки[0]
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ Неявки и ее РЕКВИЗИТОВ 

// Процедура - обработчик события "Выбор" ТЧ
//
Процедура НеявкиВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ФормаРедактированияСтроки = ПолучитьФорму("ФормаДокументов",ЭтаФорма,ВыбраннаяСтрока);
	ЗаполнитьЗначенияСвойств(ФормаРедактированияСтроки,ВыбраннаяСтрока);
	ФормаРедактированияСтроки.Организация = Организация;
	ФормаРедактированияСтроки.ОткрытьМодально();
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

// Процедура - обработчик события "ПриВыводеСтроки" ТЧ
//
Процедура НеявкиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	// Выделим синим цветом дублирующиеся строки.
	Если ДанныеСтроки.ДублирующаясяСтрока Тогда
		ОформлениеСтроки.ЦветТекста  = Новый Цвет(0, 0, 255);
	КонецЕсли;
	
	// При наличии обоих документов покажем стандартный значок для отображения состояния расчетного документа
	ЯчейкаСКартинкой = ОформлениеСтроки.Ячейки.Картинка;
	Если ЗначениеЗаполнено(ДанныеСтроки.РасчетныйДокумент)
		И ЗначениеЗаполнено(ДанныеСтроки.КадровыйДокумент) Тогда
		ЯчейкаСКартинкой.ОтображатьКартинку = Истина;
		ЯчейкаСКартинкой.ИндексКартинки = ?(ДанныеСтроки.РасчетныйДокумент.Проведен, 0, 2);
	Иначе
		ЯчейкаСКартинкой.ОтображатьКартинку = Ложь;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ ОБЪЕКТА 

мНастройкаПериода = Новый НастройкаПериода;
мСоответствиеТиповДокументов = Новый Соответствие;
